; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)
  (:functions 	(time-to-walk ?l1 ?l2 - location)
		(time-to-drive ?l1 ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-3-4-4-288)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	p1-3 - location
	p6-1 - location
	p6-2 - location
	p6-5 - location
	p5-1 - location
	p5-2 - location
	p3-5 - location
	p2-0 - location
	p4-0 - location
	p4-5 - location
	p0-1 - location
	)
	(:init
	(at driver1 s0)
	(at driver2 s5)
	(at driver3 s0)
	(at truck1 s0)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s5)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s4)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s4)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at package1 s6)
	(at package2 s1)
	(at package3 s0)
	(at package4 s1)
	(path s1 p1-3)
	(path p1-3 s1)
	(path s3 p1-3)
	(path p1-3 s3)
	(= (time-to-walk s1 p1-3) 29)
	(= (time-to-walk p1-3 s1) 29)
	(= (time-to-walk s3 p1-3) 36)
	(= (time-to-walk p1-3 s3) 36)
	(path s6 p6-1)
	(path p6-1 s6)
	(path s1 p6-1)
	(path p6-1 s1)
	(= (time-to-walk s6 p6-1) 58)
	(= (time-to-walk p6-1 s6) 58)
	(= (time-to-walk s1 p6-1) 11)
	(= (time-to-walk p6-1 s1) 11)
	(path s6 p6-2)
	(path p6-2 s6)
	(path s2 p6-2)
	(path p6-2 s2)
	(= (time-to-walk s6 p6-2) 49)
	(= (time-to-walk p6-2 s6) 49)
	(= (time-to-walk s2 p6-2) 56)
	(= (time-to-walk p6-2 s2) 56)
	(path s6 p6-5)
	(path p6-5 s6)
	(path s5 p6-5)
	(path p6-5 s5)
	(= (time-to-walk s6 p6-5) 56)
	(= (time-to-walk p6-5 s6) 56)
	(= (time-to-walk s5 p6-5) 38)
	(= (time-to-walk p6-5 s5) 38)
	(path s5 p5-1)
	(path p5-1 s5)
	(path s1 p5-1)
	(path p5-1 s1)
	(= (time-to-walk s5 p5-1) 53)
	(= (time-to-walk p5-1 s5) 53)
	(= (time-to-walk s1 p5-1) 27)
	(= (time-to-walk p5-1 s1) 27)
	(path s5 p5-2)
	(path p5-2 s5)
	(path s2 p5-2)
	(path p5-2 s2)
	(= (time-to-walk s5 p5-2) 40)
	(= (time-to-walk p5-2 s5) 40)
	(= (time-to-walk s2 p5-2) 40)
	(= (time-to-walk p5-2 s2) 40)
	(path s3 p3-5)
	(path p3-5 s3)
	(path s5 p3-5)
	(path p3-5 s5)
	(= (time-to-walk s3 p3-5) 32)
	(= (time-to-walk p3-5 s3) 32)
	(= (time-to-walk s5 p3-5) 5)
	(= (time-to-walk p3-5 s5) 5)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(= (time-to-walk s2 p2-0) 29)
	(= (time-to-walk p2-0 s2) 29)
	(= (time-to-walk s0 p2-0) 2)
	(= (time-to-walk p2-0 s0) 2)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(= (time-to-walk s4 p4-0) 27)
	(= (time-to-walk p4-0 s4) 27)
	(= (time-to-walk s0 p4-0) 54)
	(= (time-to-walk p4-0 s0) 54)
	(path s4 p4-5)
	(path p4-5 s4)
	(path s5 p4-5)
	(path p4-5 s5)
	(= (time-to-walk s4 p4-5) 7)
	(= (time-to-walk p4-5 s4) 7)
	(= (time-to-walk s5 p4-5) 58)
	(= (time-to-walk p4-5 s5) 58)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(= (time-to-walk s0 p0-1) 60)
	(= (time-to-walk p0-1 s0) 60)
	(= (time-to-walk s1 p0-1) 58)
	(= (time-to-walk p0-1 s1) 58)
	(link s3 s0)
	(link s0 s3)
	(= (time-to-drive s3 s0) 17)
	(= (time-to-drive s0 s3) 17)
	(link s3 s5)
	(link s5 s3)
	(= (time-to-drive s3 s5) 55)
	(= (time-to-drive s5 s3) 55)
	(link s3 s6)
	(link s6 s3)
	(= (time-to-drive s3 s6) 21)
	(= (time-to-drive s6 s3) 21)
	(link s0 s5)
	(link s5 s0)
	(= (time-to-drive s0 s5) 50)
	(= (time-to-drive s5 s0) 50)
	(link s0 s6)
	(link s6 s0)
	(= (time-to-drive s0 s6) 9)
	(= (time-to-drive s6 s0) 9)
	(link s4 s0)
	(link s0 s4)
	(= (time-to-drive s4 s0) 48)
	(= (time-to-drive s0 s4) 48)
	(link s4 s3)
	(link s3 s4)
	(= (time-to-drive s4 s3) 43)
	(= (time-to-drive s3 s4) 43)
	(link s4 s5)
	(link s5 s4)
	(= (time-to-drive s4 s5) 28)
	(= (time-to-drive s5 s4) 28)
	(link s4 s6)
	(link s6 s4)
	(= (time-to-drive s4 s6) 6)
	(= (time-to-drive s6 s4) 6)
	(link s1 s3)
	(link s3 s1)
	(= (time-to-drive s1 s3) 25)
	(= (time-to-drive s3 s1) 25)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 2)
	(= (time-to-drive s0 s2) 2)
	(link s6 s1)
	(link s1 s6)
	(= (time-to-drive s6 s1) 26)
	(= (time-to-drive s1 s6) 26)
	(link s6 s2)
	(link s2 s6)
	(= (time-to-drive s6 s2) 6)
	(= (time-to-drive s2 s6) 6)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s2)
	(at driver2 s4)
	(at truck2 s4)
	(at truck3 s5)
	(at package1 s0)
	(at package2 s6)
	(at package3 s1)
	(at package4 s3)
	))

(:metric minimize (+ (* 1 (total-time)) (* 1 (fuel-used))))

)

; plan
1. (walk driver2 s5 p4-5)
   deleted: (at driver2 s5)
   added: (at driver2 p4-5)
   goals met: 0 of 8
2. (load-truck package3 truck1 s0)
   deleted: (at package3 s0)
   added: (in package3 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 0 of 8
3. (board-truck driver3 truck1 s0)
   deleted: (at driver3 s0) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 0 of 8
4. (walk driver1 s0 p2-0)
   deleted: (at driver1 s0)
   added: (at driver1 p2-0)
   goals met: 0 of 8
5. (walk driver1 p2-0 s2)
   deleted: (at driver1 p2-0)
   added: (at driver1 s2)
   goals met: 1 of 8
6. (drive-truck truck1 s0 s6 driver3)
   deleted: (at truck1 s0)
   added: (at truck1 s6)
   changed: (fuel-used) from 0 to 99
   goals met: 1 of 8
7. (load-truck package1 truck1 s6)
   deleted: (at package1 s6)
   added: (in package1 truck1)
   changed: (load truck1) from 1 to 2, (fuel-per-minute truck1) from 11 to 13
   goals met: 1 of 8
8. (drive-truck truck1 s6 s0 driver3)
   deleted: (at truck1 s6)
   added: (at truck1 s0)
   changed: (fuel-used) from 99 to 216
   goals met: 1 of 8
9. (unload-truck package1 truck1 s0)
   deleted: (in package1 truck1)
   added: (at package1 s0)
   changed: (load truck1) from 2 to 1, (fuel-per-minute truck1) from 13 to 11
   goals met: 2 of 8
10. (drive-truck truck1 s0 s6 driver3)
   deleted: (at truck1 s0)
   added: (at truck1 s6)
   changed: (fuel-used) from 216 to 315
   goals met: 2 of 8
11. (drive-truck truck1 s6 s1 driver3)
   deleted: (at truck1 s6)
   added: (at truck1 s1)
   changed: (fuel-used) from 315 to 601
   goals met: 2 of 8
12. (unload-truck package3 truck1 s1)
   deleted: (in package3 truck1)
   added: (at package3 s1)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 3 of 8
13. (load-truck package2 truck1 s1)
   deleted: (at package2 s1)
   added: (in package2 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 3 of 8
14. (load-truck package4 truck1 s1)
   deleted: (at package4 s1)
   added: (in package4 truck1)
   changed: (load truck1) from 1 to 2, (fuel-per-minute truck1) from 11 to 13
   goals met: 3 of 8
15. (drive-truck truck1 s1 s6 driver3)
   deleted: (at truck1 s1)
   added: (at truck1 s6)
   changed: (fuel-used) from 601 to 939
   goals met: 3 of 8
16. (unload-truck package2 truck1 s6)
   deleted: (in package2 truck1)
   added: (at package2 s6)
   changed: (load truck1) from 2 to 1, (fuel-per-minute truck1) from 13 to 11
   goals met: 4 of 8
17. (drive-truck truck1 s6 s3 driver3)
   deleted: (at truck1 s6)
   added: (at truck1 s3)
   changed: (fuel-used) from 939 to 1170
   goals met: 4 of 8
18. (unload-truck package4 truck1 s3)
   deleted: (in package4 truck1)
   added: (at package4 s3)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 5 of 8
19. (walk driver2 p4-5 s4)
   deleted: (at driver2 p4-5)
   added: (at driver2 s4)
   goals met: 6 of 8
20. (board-truck driver2 truck3 s4)
   deleted: (at driver2 s4) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 5 of 8
21. (drive-truck truck3 s4 s5 driver2)
   deleted: (at truck3 s4)
   added: (at truck3 s5)
   changed: (fuel-used) from 1170 to 1450
   goals met: 6 of 8
22. (disembark-truck driver2 truck3 s5)
   deleted: (driving driver2 truck3)
   added: (at driver2 s5) (empty truck3)
   goals met: 6 of 8
23. (board-truck driver2 truck2 s5)
   deleted: (at driver2 s5) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 6 of 8
24. (drive-truck truck2 s5 s4 driver2)
   deleted: (at truck2 s5)
   added: (at truck2 s4)
   changed: (fuel-used) from 1450 to 1730
   goals met: 7 of 8
25. (disembark-truck driver2 truck2 s4)
   deleted: (driving driver2 truck2)
   added: (at driver2 s4) (empty truck2)
   goals met: 8 of 8
